# 🚀 อะมีบาแบ่งตัว

# อะมีบาเป็นสัตว์เซลล์เดียว สามารถขยายพันธุ์ได้ด้วยการแบ่งตัวเอง โดยนักวิทยาศาสตร์ได้ทดลองแล้วพบว่า หากนำอะมีบาไปเลี้ยงในอุณหภูมิที่เหมาะสม ทุกๆ 1 ชั่วโมง อะมีบาสามารถเพิ่มจำนวนเป็น 2 เท่าได้

# หากนักวิทยาศาสตร์มีอะมีบาอยู่จำนวนหนึ่ง และต้องการเพาะเลี้ยงอะมีบาให้ได้เพียงพอ กับจำนวนที่ต้องการ อยากทราบว่าจะต้องใช้เวลาเลี้ยงอย่างน้อยที่สุด กี่ชั่วโมง

# 📥 รูปแบบข้อมูล Input

# ข้อมูล Input จะระบุมาผ่านตัวแปรตั้งต้นใน Init Code โดยตัวแปรต่างๆ มีคุณสมบัติต่อไปนี้:

# - ตัวแปร have คือจำนวนอะมีบาตั้งต้นที่มี เป็นจำนวนเต็มบวก มีค่าระหว่าง 1 - 1,000,000,000

# - ตัวแปร need คือจำนวนอะมีบาที่ต้องการเป็นอย่างน้อย เป็นจำนวนเต็มบวก มีค่าระหว่าง 1 - 1,000,000,000

have = 1
need = 15

time = 0

while have < need:
    have *= 2
    time += 1

print(time)