# 🚀 ช็อกโกสติ๊ก

# เชฟเนียนได้ช็อกโกแลตชั้นดี 1 ชิ้น ซึ่งแบ่งออกเป็น 9 ส่วนในลักษณะสี่เหลี่ยมจตุรัสแบบ 3x3 ด้วยสายตาอันแหลมคมของเชฟเนียน สามารถประเมินคุณภาพช็อกโกแลตทั้ง 9 ชิ้นเป็นคะแนนได้ ตัวอย่างเช่น


# 1 2 3
# 4 5 6
# 7 8 9

# คุณเป็นลูกมือเชฟเนียน ต้องการเอาช็อกโกแลตแท่ง ไปทำช็อกโกสติ๊กเลิศรส โดยเลือกเอาตัดช็อกโกแลตในแนวตั้ง 3 ช่องติดกัน หรือแนวนอน 3 ช่องติดกันมาใช้ ทั้งนี้เพื่อไม่ให้เสียคุณค่าของช็อกโกแลตชั้นดี จะต้องเลือกวิธีตัดที่ได้คะแนนคุณภาพรวมดีที่สุด


# ลองเขียนโปรแกรมช่วยตัดสินใจดูว่า วิธีเลือกช็อกโกแลตให้ได้คุณภาพดีที่สุด จะได้คะแนนคุณภาพรวมเท่าไร



# 📥 รูปแบบข้อมูล Input

# ข้อมูล Input จะระบุมาผ่านตัวแปรตั้งต้นใน Init Code โดยตัวแปรต่างๆ มีคุณสมบัติต่อไปนี้:



# - table คือคะแนนคุณของช็อกโกแลตแต่ละช่อง เป็นตัวแปรลิสต์สองมิติ ขนาด 3x3 ช่อง แต่ละช่องเป็นตัวเลขจำนวนเต็ม ที่มีค่าระหว่าง -1,000,000 - 1,000,000

table = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

max1 = max(sum(row) for row in table)
max2 = max(sum(column) for column in zip(*table))
maxscore = max(max1, max2)
print(maxscore)