# 🚀 ผจญภัยเหมืองแร่

# ในบอร์ดเกม "ผจญภัยเหมืองแร่" ผู้เล่นจะได้สิทธิ์ในการเข้าไปสำรวจเหมืองที่ถูกขุดเจาะไว้ ซึ่งเป็นถ้ำที่มีทางเดินเข้าไปเป็นเส้นตรงเพียงทางเดียว ผ่านพื้นที่แต่ละช่อง โดยนักสำรวจ ได้สำรวจปริมาณแร่ในแต่ละช่องไว้ให้แล้ว

# อยากให้คุณช่วยประเมินว่า ในสถานการณ์ที่กำหนดให้ หากผู้เล่นเดินเข้าไปในเหมืองทีละช่องตามลำดับ โดยเริ่มจากช่องแรกสุด และเก็บแร่ที่มีในทุกๆ ช่องที่เดินผ่าน ผู้เล่นจะต้องเดินเข้าไป "อย่างน้อยที่สุด"​ กี่ช่อง จึงจะมีแร่สะสมเพียงพอ ตามเป้าหมายที่ต้องการ

# 📥 รูปแบบข้อมูล Input

# ข้อมูล Input จะระบุมาผ่านตัวแปรตั้งต้นใน Init Code โดยตัวแปรต่างๆ มีคุณสมบัติต่อไปนี้:

# - ตัวแปร need คือจำนวนแร่รวมที่ต้องการสะสมได้ เป็นจำนวนเต็มบวก มีค่าระหว่าง 0 - 1,000,000

# - ตัวแปร items เป็น list ระบุจำนวนแร่ในแต่ละช่องตามลำดับ โดยมีทั้งหมด 1 - 1,000 ช่อง แต่ละช่องเป็นจำนวนเต็มบวก มีค่าระหว่าง 0 - 1,000,000

# - การันตีว่า ในสถานการณ์ที่กำหนดให้ ผู้เล่นจะมีวิธีเก็บแร่สะสมได้เพียงพอกับเป้าหมายอย่างแน่นอน