# 🚀 ไม่ลดลงเลย

# ลำดับตัวเลขที่ "ไม่ลดลงเลย" คือชุดตัวเลขที่ เมื่อดูตัวเลขแต่ละตัวตามลำดับแล้ว ตัวเลขตัวถัดไปจะมีค่า "มากกว่า หรือเท่ากับ" เลขตัวก่อนหน้าเสมอ ตัวอย่างเช่น



# - ชุดตัวเลข 10, 10, 20, 30, 40 เป็นชุดตัวเลขไม่ลดลงเลย

# - ชุดตัวเลข 5, 25, 15, 35, 45, 55 ไม่เป็นชุดตัวเลขไม่ลดลงเลย (เพราะ 15 น้อยกว่า 25 ที่เป็นเลขก่อนหน้า)


# ให้คุณช่วยตรวจสอบลำดับตัวเลขที่กำหนดให้ ว่าเป็น "ลำดับไม่ลดลงเลย" หรือไม่



# 📥 รูปแบบข้อมูล Input

# ข้อมูล Input จะระบุมาผ่านตัวแปรตั้งต้นใน Init Code โดยตัวแปรต่างๆ มีคุณสมบัติต่อไปนี้:



# - ตัวแปร nums เป็นลิสต์ที่มีสมาชิก จำนวน 3 - 1,000 ตัว แต่ละตัวเป็นจำนวนเต็ม ที่มีค่าระหว่าง -1,000,000,000 - 1,000,000,000

nums = [10, 10, 20, 30, 40]

isnondecreasing = all(nums[i] <= nums[i+1] for i in range(len(nums)-1))

if isnondecreasing:
    print("yes")
else:
    print("no")